app/Controllers/Admin.php

    public function approveAnggotaAdmin($id_user)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->where('id_user', $id_user);
        $builder->update(['is_active' => 1]);

        // ambil email user yg di-approve
        $user = $builder->where('id_user', $id_user)->get()->getRow();
---
UPDATE `tbl_user` SET `is_active` = 1
WHERE `id_user` = '15'
SELECT *
FROM `tbl_user`
WHERE `id_user` = '15'