app/Controllers/Pengajar.php

INSERT INTO `jawaban` (`id_soal`, `jawaban`, `benar`) VALUES (5, 'a', 0)
---
    public function addSoal2()
    {
        $db = \Config\Database::connect();

        $data = [
            'soal' => $this->request->getPost('soal')
        ];

        $this->soalModel->saveSoal($data);

        // Ambil id soal yang baru saja dimasukkan
        $id_soal = $this->soalModel->getInsertID();

        // 2. Ambil data jawaban dari form
        $jawabanList = $this->request->getPost('jawaban'); // array
        $benar = $this->request->getPost('benar'); // 1,2,3,4 sesuai radio button

        // 3. Loop untuk simpan ke tabel jawaban
        foreach ($jawabanList as $key => $val) {
            $jawabanData = [
                'id_soal' => $id_soal,
                'jawaban' => $val,
                'benar'   => ($benar == $key) ? 1 : 0
            ];
            $db->table('jawaban')->insert($jawabanData);