app/Models/JawabanModel.php

SELECT *
FROM `jawaban`
WHERE `id_soal` = 5
---
    public function getJawaban(int $id): ?array
    {
        $db = \Config\Database::connect();
        $builder = $db->table('jawaban');

        $builder->select('*')->where('id_soal', $id);

        $query = $builder->get();