app/Models/M_login.php

    public function cek_users($username, $password)
    {
        $user = $this->where('username', $username)->first();
        $user = $this->db->table('tbl_user')->where('username', $username)->get()->getRow();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'guru'