app/Models/SoalModel.php

    public function saveSoal(array $data): bool
    {
        return $this->insert($data);
---
INSERT INTO `soal` (`soal`) VALUES ('TEST SOAL BARU')

    public function getSoal()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('soal');

        $builder->select('soal.*, jadwal.pelajaran');
        $builder->join('jadwal', 'jadwal.id_jadwal = soal.id_jadwal');
        $builder->groupBy('jadwal.id_jadwal');

        $query = $builder->get();
---
SELECT *
FROM `soal`

    public function getSoalSingle(int $id): ?array
    {
        return $this->where('id_soal', $id)->first();
---
SELECT *
FROM `soal`
WHERE `id_soal` = 5
 LIMIT 1